Project/Toir/src/Documents/гкс_ЕВОБланк/гкс_ЕВОБланк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>гкс_ЕВОБланк</name>
  <basedOn>Document.торо_ВыявленныеДефекты</basedOn>
  <registerRecords>InformationRegister.гкс_ОжидаемыеМероприятияЕвобланк</registerRecords>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневаяПричина</name>
    <type>
      <types>CatalogRef.гкс_КорневыеПричины</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипКорневойПричины</name>
    <type>
      <types>CatalogRef.гкс_ТипыКорневыхПричин</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ВыявленныеДефекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаОстановки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяВызоваТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЗапуска</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНеисправности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>МерыПринятые</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КорневаяПричинаТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазборТребуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕвоБланкПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньОстанова</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НачальникСмены</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДиаграммаСобытий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияТС</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПроблемы</name>
    <type>
      <types>EnumRef.гкс_ТипыПроблем</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗонаОтветственности</name>
    <type>
      <types>EnumRef.гкс_ЗоныОтветственности</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ПовторныйОтказ</name>
    <comment>TOIR20-534</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>МероприятияПоПредупреждению</name>
    <attributes>
      <name>Мероприятие</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ответственный</name>
      <comment>TOIR20-462</comment>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Срок</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Выполнено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>АнализПричины</name>
    <attributes>
      <name>Причина</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РодительИД</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КорневаяПричина</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_ВыявленныеДефекты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДефектПричина</name>
    <type>
      <types>CatalogRef.торо_ПричиныДефектов</types>
    </type>
  </resources>
  <resources>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </resources>
  <resources>
    <name>ВидДефекта</name>
    <type>
      <types>CatalogRef.торо_ВидыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>КритичностьДефекта</name>
    <type>
      <types>CatalogRef.торо_КритичностьДефекта</types>
    </type>
  </resources>
  <resources>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ДефектОписание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НаправлениеНаУстранение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>гкс_СимптомДефекта</name>
    <type>
      <types>CatalogRef.гкс_СимптомыДефектов</types>
    </type>
  </resources>
  <resources>
    <name>гкс_КорневаяПричина</name>
    <type>
      <types>CatalogRef.гкс_КорневыеПричины</types>
    </type>
  </resources>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтказавшийЭлемент</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/гкс_ОжидаемыеМероприятияЕвобланк/гкс_ОжидаемыеМероприятияЕвобланк.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ОжидаемыеМероприятияЕвобланк</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Мероприятие</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Срок</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <comment>TOIR20-462</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>DocumentRef.гкс_ЕВОБланк</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/гкс_ЕВОБланк/ObjectModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ДокументОснование = ДанныеЗаполнения;
	Если Не ДанныеЗаполнения = Неопределено Тогда 
		Организация = ДанныеЗаполнения.Организация;
		Подразделение = ДанныеЗаполнения.Подразделение;
		Ответственный = ПараметрыСеанса.ТекущийПользователь;;
		Если ДанныеЗаполнения.СписокДефектов.Количество() Тогда 
			ВидДефекта = ДанныеЗаполнения.СписокДефектов[0].ВидДефекта;
			КорневаяПричина = ДанныеЗаполнения.СписокДефектов[0].гкс_КорневаяПричина;
			ДефектОписание = ДанныеЗаполнения.СписокДефектов[0].ДефектОписание;
		КонецЕсли;
		ДатаОбнаружения = ДанныеЗаполнения.ДатаОбнаружения;
	КонецЕсли;
	торо_ЗаполнениеДокументов.ЗаполнитьСтандартныеРеквизитыШапкиПоУмолчанию(ЭтотОбъект);
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Гкс+[TOIR20-465] Зозуля А.В. от 16.10.2024. Изменено:{
	//СтрокиКУдалению = Новый Массив();
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;	
	
	ТекстСообщенияНезаполненныхПолейМероприятий = 
	 "Для записи документа необходимо заполнить Мероприятия по предупреждению, значение поля «%1» в строке № %2"; 
	// } Гкс-[TOIR20-465] Зозуля А.В. от 16.10.2024. 	
	Для Каждого СТ Из МероприятияПоПредупреждению Цикл
		// Гкс+[TOIR20-465] Зозуля А.В. от 16.10.2024. Изменено:{
		//Если ЗначениеЗаполнено(СТ.Мероприятие) = Ложь Тогда 
		//	СтрокиКУдалению.Добавить(СТ);
		//	Продолжить;
		//КонецЕсли;
		//Если ЗначениеЗаполнено(СТ.Ответственный) = Ложь ИЛИ ЗначениеЗаполнено(СТ.Срок) = Ложь Тогда 
		//	СтрокиКУдалению.Добавить(СТ);
		//	Продолжить;
		//КонецЕсли; 
		НомерСтроки = СТ.НомерСтроки;
		Если Не ЗначениеЗаполнено(СТ.Мероприятие) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(ТекстСообщенияНезаполненныхПолейМероприятий, "Мероприятие", НомерСтроки);
			Сообщение.Поле = "Объект.МероприятияПоПредупреждению["+(СТ.НомерСтроки-1)+"].Мероприятие"; 
			Сообщение.Сообщить();
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СТ.Ответственный) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(ТекстСообщенияНезаполненныхПолейМероприятий, "Ответственный", НомерСтроки);
			Сообщение.Поле = "Объект.МероприятияПоПредупреждению["+(СТ.НомерСтроки-1)+"].Ответственный";
			Сообщение.Сообщить();
		КонецЕсли; 
		Если Не ЗначениеЗаполнено(СТ.Срок) Тогда 
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон(ТекстСообщенияНезаполненныхПолейМероприятий, "Срок", НомерСтроки);
			Сообщение.Поле = "Объект.МероприятияПоПредупреждению["+(СТ.НомерСтроки-1)+"].Срок";
			Сообщение.Сообщить();
		КонецЕсли;
		// } Гкс-[TOIR20-465] Зозуля А.В. от 16.10.2024.
	КонецЦикла;
	// Гкс+[TOIR20-465] Зозуля А.В. от 16.10.2024. Удалено:{
	//Для Каждого СМ ИЗ СтрокиКУдалению Цикл
	//	МероприятияПоПредупреждению.Удалить(МероприятияПоПредупреждению.Индекс(СМ));
	//КонецЦикла;
	// } Гкс-[TOIR20-465] Зозуля А.В. от 16.10.2024.
	// Гкс+[TOIR20-526] Вялых Д.А. от 07.02.2025. Добавлено:{
	//Если не ЗначениеЗаполнено(ВидНеисправности) Тогда 
	Если Не ЗначениеЗаполнено(ЗонаОтветственности) Тогда
	// } Гкс-[TOIR20-526] Вялых Д.А. от 07.02.2025.
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указана зона ответственности";
		//Сообщение.Поле = "Объект.ВидНеисправности"; 
		Сообщение.Поле = "Объект.ЗонаОтветственности";
		Сообщение.Сообщить();
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ДокументОснование = Неопределено;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(ДокументОснование) Тогда 
		ОбновляемОснование = Ложь;
		
		ДефектОбъект = ДокументОснование.ПолучитьОбъект();
		Если ДефектОбъект.СписокДефектов.Количество() Тогда
			Если Не (ДефектОбъект.СписокДефектов[0].ВидДефекта = ВидДефекта
				И ДефектОбъект.СписокДефектов[0].гкс_КорневаяПричина = КорневаяПричина
				И ДефектОбъект.СписокДефектов[0].ДефектОписание = ДефектОписание) Тогда
				ОбновляемОснование = Истина;
			КонецЕсли;
		КонецЕсли;
		ОбновляемОснование = ОбновляемОснование ИЛИ Не ДефектОбъект.ДатаОбнаружения = ДатаОбнаружения;
		
		Если ОбновляемОснование Тогда 
			
			ДефектОбъект.СписокДефектов[0].ВидДефекта = ВидДефекта;
			ДефектОбъект.СписокДефектов[0].гкс_КорневаяПричина = КорневаяПричина;
			ДефектОбъект.СписокДефектов[0].ДефектОписание = ДефектОписание;
			ДефектОбъект.ДатаОбнаружения = ДатаОбнаружения;
			ДефектОбъект.Записать(РежимЗаписиДокумента.Запись);
			
			Если ДефектОбъект.Проведен Тогда 
				НаборЗаписей = РегистрыСведений.торо_ВыявленныеДефекты.СоздатьНаборЗаписей();
				НаборЗаписей.Отбор.Регистратор.Установить(ДефектОбъект.Ссылка);
				НаборЗаписей.Прочитать();
				Если НаборЗаписей.Количество() Тогда 
					НаборЗаписей[0].ВидДефекта = ВидДефекта;
					НаборЗаписей[0].гкс_КорневаяПричина = КорневаяПричина;
				КонецЕсли;
				НаборЗаписей.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Движения.гкс_ОжидаемыеМероприятияЕвобланк.Записывать = Истина;
	Если РазборТребуется Тогда 
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЧ.Ответственный КАК Ответственный,
		               |	ТЧ.Мероприятие КАК Мероприятие,
		               |	ТЧ.Срок КАК Срок
		               |ПОМЕСТИТЬ Исходные
		               |ИЗ
		               |	&ТЧ1 КАК ТЧ
		               |ГДЕ
		               |	ТЧ.Выполнено = ЛОЖЬ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	Исходные.Ответственный КАК Ответственный,
		               |	МАКСИМУМ(Исходные.Мероприятие) КАК Мероприятие,
		               |	Исходные.Срок КАК Срок
		               |ИЗ
		               |	Исходные КАК Исходные
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Исходные.Ответственный,
		               |	Исходные.Срок";
		Запрос.УстановитьПараметр("ТЧ1", МероприятияПоПредупреждению.Выгрузить());
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда 
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				НС = Движения.гкс_ОжидаемыеМероприятияЕвобланк.Добавить();
				НС.Период = Дата;
				НС.Ответственный = Выборка.Ответственный;
				НС.Срок = Выборка.Срок;
				НС.Мероприятие = Выборка.Мероприятие;
				НС.Источник = Ссылка;
			КонецЦикла;
		КонецЕсли
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
